# **Practical 2- Descriptive Statistics**

**1) Measures of Central Tendency**
  1. Mean
  2. Median
  3. Mode

**2) Measures of Variability**
  1. Standard Deviation
  2. Variance
  3. Min and Max Variables
  4. Skewness and Kurtosis
  5. Range
  6. Percentiles/Quartiles
  7. Box Plots

In Machine Learning (and in mathematics) there are often three values that interests us:

**Mean** - The average value

**Median** - The mid point value

**Mode** - The most common value

# **Mean**

The mean value is the average value.To calculate the mean, find the sum of all values, and divide the sum by the number of values.

Formula : âˆ‘X / N, 

where X is the array elements and N is the total number of elements.

The **NumPy** module has a method for this.

Syntax:  numpy.mean(arr)

Example 1 : We have registered the speed of 13 cars . Use the NumPy **mean()** method to find the average speed:

speed = [99,86,87,88,111,86,103,87,94,78,77,85,86]

In [ ]:
import numpy

speed = [99,86,87,88,111,86,103,87,94,78,77,85,86]

x = numpy.mean(speed)

print(x)

89.76923076923077

Example 2: Considering any huge dataset, use the NumPy mean() method to find the average along any axis.

In [ ]:
import pandas as pd
import numpy as np
drinks = pd.read_csv('https://raw.githubusercontent.com/mkareru/Dataset1/main/README.md/dataset')
drinks

In [ ]:
df = np.mean(drinks, axis=0)
print('Average alcohol serving accross each continent are as below')
df

In [ ]:
import pandas as pd
df = pd.read_csv('https://raw.githubusercontent.com/mkareru/Dataset1/main/README.md/cardata')
print("\n----------- Calculate Mean -----------\n")
print(df.mean())
 
print("\n----------- Calculate Median -----------\n")
print(df.median())
 
print("\n----------- Calculate Mode -----------\n")
print(df.mode())

----------- Calculate Mean -----------

Mahindra      19.1875
Suzuki        11.5925
Renault       16.2125
Tata          17.1850
Volkswagan    17.0375
Honda         12.3650
ferrari       11.1425
BMW           16.3300
Skoda         16.5925
Audi          15.9725
dtype: float64

----------- Calculate Median -----------

Mahindra      19.425
Suzuki        11.435
Renault       16.945
Tata          17.270
Volkswagan    17.175
Honda         12.450
ferrari       11.140
BMW           16.480
Skoda         16.615
Audi          16.275
dtype: float64

----------- Calculate Mode -----------

           Cars  Mahindra  Suzuki  Renault  ...  ferrari    BMW  Skoda   Audi
0  2001 to 2005     19.45    11.4     17.4  ...    11.14  16.48  16.78  16.45
1  2006 to 2010       NaN     NaN      NaN  ...      NaN    NaN    NaN    NaN
2  2011 to 2015       NaN     NaN      NaN  ...      NaN    NaN    NaN    NaN
3  2015 to 2020       NaN     NaN      NaN  ...      NaN    NaN    NaN    NaN

[4 rows x 11 columns]

# Median

*   The median value is the value in the middle, after you have sorted all the values: 
*   It is important that the numbers are sorted before you can find the median.

Example 1: We have registered the speed of 13 cars . Use the NumPy **median()** method to find the Mid-value (median) of those data.

speed = [99,86,87,88,111,86,103,87,94,78,77,85,86]

In [ ]:
import numpy

speed = [99,86,87,88,111,86,103,87,94,78,77,85,86]

x = numpy.median(speed)

print(x)

87.0

Example 2: Considering a huge dataset, use the NumPy median() method to find the middle value of any column.

In [ ]:
import pandas as pd
import numpy as np
drinks = pd.read_csv('https://raw.githubusercontent.com/mkareru/Dataset1/main/README.md/dataset')
drinks.head() # Display first five records

           Cars  Mahindra  Suzuki  Renault  ...  ferrari    BMW  Skoda   Audi
0  2001 to 2005     18.45   11.47    13.56  ...    10.89  15.46  16.78  14.89
1  2006 to 2010     19.45   11.40    16.49  ...    11.14  16.48  16.36  16.10
2  2011 to 2015     19.40   12.10    17.40  ...    11.40  16.90  16.45  16.45
3  2015 to 2020     19.45   11.40    17.40  ...    11.14  16.48  16.78  16.45

[4 rows x 11 columns]

In [ ]:
bs = np.median(drinks['beer_servings']); ss = np.median(drinks['spirit_servings']);
ws = np.median(drinks['wine_servings']); tl = np.median(drinks['total_litres_of_pure_alcohol']);
print('mid-value of each drinks Serving accross all Continent:')
print('Beer Serving =', bs)
print('spirit servings =', ss)
print('wine Serving =', ws)
print('total liters alcohol accross all Continent =', tl)

mid-value of each drinks Serving accross all Continent:
Beer Serving = 76.0
spirit servings = 56.0
wine Serving = 8.0
total liters alcohol accross all Continent = 4.2

# Mode

*   The Mode value is the value that appears the most number of times.
*   The SciPy module has a method for this - **SciPy mode()**

**Example 1:** We have registered the speed of 13 cars . Use the **SciPy mode()**method to find the speed that appears the most:

speed = [99,86,87,88,111,86,103,87,94,78,77,85,86]

In [ ]:
import numpy as np
from scipy import stats

speed = [99,86,87,88,111,86,103,87,94,78,77,85,86]

x = statistics.mode(speed)

print(x)

86

Example 2: Considering a huge dataset, use the **SciPy Mode()** method to find the continent that appears the most.

In [ ]:
import pandas as pd
import statistics
drinks = pd.read_csv('https://raw.githubusercontent.com/mkareru/Dataset1/main/README.md/dataset')
drinks.head() # Display first five records

       country  beer_servings  ...  total_litres_of_pure_alcohol  continent
0  Afghanistan              0  ...                           0.0         AS
1      Albania             89  ...                           4.9         EU
2      Algeria             25  ...                           0.7         AF
3      Andorra            245  ...                          12.4         EU
4       Angola            217  ...                           5.9         AF

[5 rows x 6 columns]

In [ ]:
continent = statistics.mode(drinks['continent'])
print('Continent with most number of occurance in the given dataset is', continent)

Continent with most number of occurance in the given dataset is AF